------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/noeljohnson/Dropbox/Research/Revolutionary Expropriation/Replica
> tion Files/Table 1.log
  log type:  text
 opened on:   5 Oct 2020, 11:59:44

. 
. gen lpricehect=ln(price_per_)
variable lpricehect already defined
r(110);

. gen temp=DBishopric/1000
(467 missing values generated)

. drop DBishopric

. rename temp DBishopric

. 
. sum lpricehect DBishopric if (ferme==1 | vignes==1 | metayer==1)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  lpricehect |        812    5.996252    .8097897   .9537646   13.01858
  DBishopric |        815    .0262072    .0138572   .0003163   .0607318

. 
. sum lpricehect if (ferme==1 | vignes==1 | metayer==1), detail

                         lpricehect
-------------------------------------------------------------
      Percentiles      Smallest
 1%     3.754758       .9537646
 5%      4.78206       3.671376
10%     5.129017       3.673548       Obs                 812
25%     5.607243       3.686209       Sum of Wgt.         812

50%     6.007897                      Mean           5.996252
                        Largest       Std. Dev.      .8097897
75%     6.394749       9.479465
90%     6.776127       10.24371       Variance       .6557594
95%     7.096465       10.31457       Skewness       .7946083
99%     8.149335       13.01858       Kurtosis       13.96429

. 
. eststo: quietly: reg lpricehect DBishopric if  (vignes==1 | ferme==1 | metayer==1)
> , cluster(dept_id)
(est1 stored)

. eststo: quietly: reg lpricehect DBishopric ln_ma_1789_ba_own_dist_default wheatsui
> t  if  (vignes==1 | ferme==1 | metayer==1), cluster(dept_id)
(est2 stored)

. eststo: quietly: reg lpricehect DBishopric ln_ma_1789_ba_own_dist_default wheatsui
> t  if  (vignes==1 | ferme==1 | metayer==1) & lpricehect<8.149335, cluster(dept_id)
(est3 stored)

. eststo: quietly: reg lpricehect DBishopric ln_ma_1789_ba_own_dist_default wheatsui
> t  if  (vignes==1 | ferme==1 | metayer==1) & lpricehect<7.096465, cluster(dept_id)
(est4 stored)

. esttab, replace se ar2 k(DBishopric)  star(* 0.10 ** 0.05 *** 0.01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
               lpricehect      lpricehect      lpricehect      lpricehect   
----------------------------------------------------------------------------
DBishopric         -4.872          -2.909          -2.512           0.514   
                  (4.322)         (4.352)         (3.946)         (3.026)   
----------------------------------------------------------------------------
N                     812             812             804             771   
adj. R-sq           0.006           0.037           0.054           0.052   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. log close
      name:  <unnamed>
       log:  /Users/noeljohnson/Dropbox/Research/Revolutionary Expropriation/Replica
> tion Files/Table 1.log
  log type:  text
 closed on:   5 Oct 2020, 11:59:45
------------------------------------------------------------------------------------
