------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/noeljohnson/Dropbox/Research/Revolutionary Expropriation/Replica
> tion Files/Table 8.log
  log type:  text
 opened on:   5 Oct 2020, 12:30:47

. 
. keep if sample==1
(0 observations deleted)

. 
. *Merge in new MA measures including own district and non-French cities

. merge m:m id using "/Users/noeljohnson/Dropbox/Research/Revolutionary Expropriatio
> n/Replication Files/Data Sets/Market Access with District different costs.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           591
        from master                         0  (_merge==1)
        from using                        591  (_merge==2)

    matched                             1,164  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(591 observations deleted)

. drop if id==.
(0 observations deleted)

. count
  1,164

. drop _merge

. 
. *generate logs of MA variables

. gen ln_ma_1789_bo_own_dist_default = ln(ma_1789_bo_own_dist_default)

. gen ln_ma_1789_ba_own_dist_default = ln(ma_1789_ba_own_dist_default)

. gen ln_ma_1789_ca_own_dist_default = ln(ma_1789_ca_own_dist_default)

. gen ln_ma_1789_ma_own_dist_default = ln(ma_1789_ma_own_dist_default)

. 
. merge m:m id using "/Users/noeljohnson/Dropbox/Research/Revolutionary Expropriatio
> n/Replication Files/Data Sets/France_Bishop_Near.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           340
        from master                         0  (_merge==1)
        from using                        340  (_merge==2)

    matched                             1,164  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(340 observations deleted)

. drop _merge

. 
. *Begin Analysis

. 
. *Table 8: Percent Land Confiscated in District and Wheat Yields Over Time

. *Column 1: Using the district level RHS variables, but department level LHS variab
> les

. xi: reg lwheatyield i.year*super1adj i.year*wheatsuit i.year*ln_ma_1789_ba_own_dis
> t_default i.year*i.FE13, cluster(deptid)
i.year            _Iyear_1841-1929    (naturally coded; _Iyear_1841 omitted)
i.year*super1~j   _IyeaXsup_#         (coded as above)
i.year*wheats~t   _IyeaXwhe_#         (coded as above)
i.year*ln_ma_..   _IyeaXln__#         (coded as above)
i.FE13            _IFE13_1-12         (naturally coded; _IFE13_1 omitted)
i.year*i.FE13     _IyeaXFE1_#_#       (coded as above)
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity

Linear regression                               Number of obs     =      1,152
                                                F(60, 60)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7354
                                                Root MSE          =     .16002

                                     (Std. Err. adjusted for 61 clusters in deptid)
-----------------------------------------------------------------------------------
                  |               Robust
      lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |   1.707328   1.507709     1.13   0.262    -1.308539    4.723194
      _Iyear_1912 |   1.004966   1.713118     0.59   0.560    -2.421781    4.431712
      _Iyear_1929 |  -.1030299   1.472565    -0.07   0.944    -3.048599    2.842539
        super1adj |   .0094148   .0046467     2.03   0.047       .00012    .0187096
   _IyeaXsup_1852 |  -.0016019   .0014735    -1.09   0.281    -.0045493    .0013455
   _IyeaXsup_1875 |  -.0096422    .004751    -2.03   0.047    -.0191456   -.0001388
   _IyeaXsup_1892 |    -.00735    .004083    -1.80   0.077    -.0155173    .0008172
   _IyeaXsup_1912 |  -.0049647   .0037462    -1.33   0.190    -.0124581    .0025287
   _IyeaXsup_1929 |   -.005796    .004063    -1.43   0.159    -.0139231    .0023312
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |     1.0284   2.186323     0.47   0.640    -3.344897    5.401697
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |          0  (omitted)
        wheatsuit |  -.0230079   .0163589    -1.41   0.165    -.0557306    .0097149
   _IyeaXwhe_1852 |   .0223899   .0121522     1.84   0.070    -.0019181    .0466978
   _IyeaXwhe_1875 |   .0335613   .0241476     1.39   0.170    -.0147411    .0818637
   _IyeaXwhe_1892 |   .0284896   .0143227     1.99   0.051      -.00016    .0571392
   _IyeaXwhe_1912 |   .0069002   .0210519     0.33   0.744    -.0352098    .0490102
   _IyeaXwhe_1929 |   .0092275   .0199278     0.46   0.645    -.0306341    .0490891
      _Iyear_1852 |   .0464419   .8783496     0.05   0.958    -1.710519    1.803403
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |          0  (omitted)
ln_ma_1789_ba_o~t |    .128506    .115716     1.11   0.271    -.1029605    .3599725
   _IyeaXln__1852 |   .0040965   .0663238     0.06   0.951    -.1285707    .1367638
   _IyeaXln__1875 |  -.0658375   .1670782    -0.39   0.695    -.4000436    .2683686
   _IyeaXln__1892 |  -.1067976   .1152288    -0.93   0.358    -.3372894    .1236942
   _IyeaXln__1912 |   -.043194   .1308254    -0.33   0.742    -.3048837    .2184957
   _IyeaXln__1929 |   .0264074   .1142167     0.23   0.818    -.2020599    .2548748
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |          0  (omitted)
         _IFE13_2 |  -.1837397   .0691241    -2.66   0.010    -.3220085   -.0454709
         _IFE13_3 |   .2604287   .0950584     2.74   0.008     .0702836    .4505739
         _IFE13_4 |    .064654   .1286468     0.50   0.617    -.1926778    .3219858
         _IFE13_5 |  -.0912204   .0575088    -1.59   0.118    -.2062551    .0238142
         _IFE13_6 |   .3111451    .114225     2.72   0.008     .0826611    .5396292
         _IFE13_7 |   .0164182   .0676973     0.24   0.809    -.1189966     .151833
         _IFE13_8 |   .1869285    .072949     2.56   0.013     .0410088    .3328482
         _IFE13_9 |   .1105708   .1301541     0.85   0.399    -.1497761    .3709177
        _IFE13_10 |   .4060049   .0994261     4.08   0.000     .2071232    .6048866
        _IFE13_11 |   .1296075   .0564562     2.30   0.025     .0166783    .2425368
        _IFE13_12 |  -.0145868   .1286612    -0.11   0.910    -.2719475     .242774
 _IyeaXFE1_1852_2 |  -.0401728   .0592543    -0.68   0.500     -.158699    .0783534
 _IyeaXFE1_1852_3 |  -.0814749   .0722816    -1.13   0.264    -.2260597      .06311
 _IyeaXFE1_1852_4 |  -.0838088   .0581549    -1.44   0.155    -.2001359    .0325184
 _IyeaXFE1_1852_5 |  -.2318271   .0906644    -2.56   0.013    -.4131829   -.0504714
 _IyeaXFE1_1852_6 |  -.0791488   .0645429    -1.23   0.225    -.2082539    .0499563
 _IyeaXFE1_1852_7 |  -.1359198   .0793951    -1.71   0.092    -.2947336     .022894
 _IyeaXFE1_1852_8 |  -.4666925   .0752649    -6.20   0.000    -.6172448   -.3161402
 _IyeaXFE1_1852_9 |  -.0830279   .0767573    -1.08   0.284    -.2365653    .0705095
_IyeaXFE1_1852_10 |  -.0556809   .0670283    -0.83   0.409    -.1897575    .0783957
_IyeaXFE1_1852_11 |  -.1217837   .0716288    -1.70   0.094    -.2650626    .0214951
_IyeaXFE1_1852_12 |  -.1533821   .0572548    -2.68   0.010    -.2679087   -.0388555
 _IyeaXFE1_1875_2 |   .0580798   .1084397     0.54   0.594    -.1588319    .2749916
 _IyeaXFE1_1875_3 |   -.178213   .1303816    -1.37   0.177    -.4390151    .0825891
 _IyeaXFE1_1875_4 |  -.3113743   .1221302    -2.55   0.013     -.555671   -.0670776
 _IyeaXFE1_1875_5 |  -.1053024   .1416608    -0.74   0.460    -.3886661    .1780614
 _IyeaXFE1_1875_6 |   .0559483   .1254725     0.45   0.657    -.1950341    .3069308
 _IyeaXFE1_1875_7 |  -.0081502   .1246773    -0.07   0.948    -.2575419    .2412416
 _IyeaXFE1_1875_8 |  -.2978253   .1325004    -2.25   0.028    -.5628656    -.032785
 _IyeaXFE1_1875_9 |  -.3426437   .1656907    -2.07   0.043    -.6740745   -.0112129
_IyeaXFE1_1875_10 |  -.0770654   .1227427    -0.63   0.532    -.3225873    .1684566
_IyeaXFE1_1875_11 |  -.1143938   .1065532    -1.07   0.287    -.3275319    .0987443
_IyeaXFE1_1875_12 |  -.2194497   .0902133    -2.43   0.018    -.3999032   -.0389963
 _IyeaXFE1_1892_2 |    .041687   .0850144     0.49   0.626    -.1283672    .2117412
 _IyeaXFE1_1892_3 |  -.3083586   .1049657    -2.94   0.005    -.5183213    -.098396
 _IyeaXFE1_1892_4 |  -.0311851    .109402    -0.29   0.777    -.2500216    .1876514
 _IyeaXFE1_1892_5 |  -.0639329   .0536212    -1.19   0.238    -.1711912    .0433255
 _IyeaXFE1_1892_6 |   .0266288   .0866044     0.31   0.760    -.1466057    .1998633
 _IyeaXFE1_1892_7 |  -.0136208   .0910068    -0.15   0.882    -.1956615      .16842
 _IyeaXFE1_1892_8 |  -.2269626   .0729371    -3.11   0.003    -.3728586   -.0810667
 _IyeaXFE1_1892_9 |   .0139346   .1027339     0.14   0.893    -.1915639    .2194331
_IyeaXFE1_1892_10 |  -.0527219   .0908255    -0.58   0.564    -.2343999     .128956
_IyeaXFE1_1892_11 |  -.1761562   .0621005    -2.84   0.006    -.3003757   -.0519366
_IyeaXFE1_1892_12 |  -.1689416   .0565815    -2.99   0.004    -.2821214   -.0557618
 _IyeaXFE1_1912_2 |   -.061016   .1034589    -0.59   0.558    -.2679647    .1459327
 _IyeaXFE1_1912_3 |  -.1768314   .1038775    -1.70   0.094    -.3846174    .0309546
 _IyeaXFE1_1912_4 |  -.0774645   .1261808    -0.61   0.542    -.3298636    .1749346
 _IyeaXFE1_1912_5 |   .0003301   .0714569     0.00   0.996    -.1426049    .1432652
 _IyeaXFE1_1912_6 |   .1084441   .0964515     1.12   0.265    -.0844877    .3013759
 _IyeaXFE1_1912_7 |  -.0576021   .1236029    -0.47   0.643    -.3048447    .1896406
 _IyeaXFE1_1912_8 |  -.3417941   .1032477    -3.31   0.002    -.5483203   -.1352679
 _IyeaXFE1_1912_9 |  -.0079669   .0924817    -0.09   0.932    -.1929577     .177024
_IyeaXFE1_1912_10 |   .0811851   .0946182     0.86   0.394    -.1080794    .2704496
_IyeaXFE1_1912_11 |  -.1653815   .0870682    -1.90   0.062    -.3395438    .0087808
_IyeaXFE1_1912_12 |  -.2438689   .0679444    -3.59   0.001    -.3797779   -.1079598
 _IyeaXFE1_1929_2 |   .2717466   .0815345     3.33   0.001     .1086532      .43484
 _IyeaXFE1_1929_3 |   -.007265   .0984146    -0.07   0.941    -.2041234    .1895934
 _IyeaXFE1_1929_4 |  -.0876406   .1413866    -0.62   0.538    -.3704558    .1951747
 _IyeaXFE1_1929_5 |  -.0043029   .0759995    -0.06   0.955    -.1563246    .1477187
 _IyeaXFE1_1929_6 |   .0635583   .1047627     0.61   0.546    -.1459984    .2731149
 _IyeaXFE1_1929_7 |   .0301409   .0869405     0.35   0.730    -.1437659    .2040477
 _IyeaXFE1_1929_8 |  -.1474647   .0840297    -1.75   0.084    -.3155491    .0206197
 _IyeaXFE1_1929_9 |   .3131326   .1271439     2.46   0.017     .0588069    .5674583
_IyeaXFE1_1929_10 |  -.0219619   .0950161    -0.23   0.818    -.2120225    .1680986
_IyeaXFE1_1929_11 |   .1661403   .1157302     1.44   0.156    -.0653546    .3976352
_IyeaXFE1_1929_12 |   -.028686    .122302    -0.23   0.815    -.2733264    .2159544
            _cons |   .7650077    1.51552     0.50   0.616    -2.266484      3.7965
-----------------------------------------------------------------------------------

. lincom super1adj

 ( 1)  super1adj = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0094148   .0046467     2.03   0.047       .00012    .0187096
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1852

 ( 1)  super1adj + _IyeaXsup_1852 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0078129   .0043385     1.80   0.077    -.0008655    .0164913
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1875

 ( 1)  super1adj + _IyeaXsup_1875 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0002274   .0024232    -0.09   0.926    -.0050746    .0046198
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1892

 ( 1)  super1adj + _IyeaXsup_1892 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0020648   .0019871     1.04   0.303      -.00191    .0060395
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1912

 ( 1)  super1adj + _IyeaXsup_1912 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0044501   .0023727     1.88   0.066    -.0002961    .0091962
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1929

 ( 1)  super1adj + _IyeaXsup_1929 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0036188   .0021534     1.68   0.098    -.0006885    .0079262
------------------------------------------------------------------------------

. ereturn list

scalars:
               e(rank) =  61
               e(ll_0) =  -242.5918061898258
                 e(ll) =  523.2577879324795
               e(r2_a) =  .7132437659594248
                e(rss) =  27.1925792732041
                e(mss) =  75.58262342532034
               e(rmse) =  .1600158280577448
                 e(r2) =  .7354169239347604
                  e(F) =  .
               e(df_r) =  60
               e(df_m) =  60
                  e(N) =  1152
            e(N_clust) =  61

macros:
            e(cmdline) : "regress lwheatyield _Iyear_* super1adj _IyeaXsup_* _Iy.."
              e(title) : "Linear regression"
          e(marginsok) : "XB default"
                e(vce) : "cluster"
             e(depvar) : "lwheatyield"
                e(cmd) : "regress"
         e(properties) : "b V"
            e(predict) : "regres_p"
              e(model) : "ols"
          e(estat_cmd) : "regress_estat"
            e(vcetype) : "Robust"
           e(clustvar) : "deptid"

matrices:
                  e(b) :  1 x 105
                  e(V) :  105 x 105
       e(V_modelbased) :  105 x 105

functions:
             e(sample)   

. 
. *Table 8: Percent Land Confiscated in District and Wheat Yields Over Time

. *Column 2: Using the district level RHS variables, but department level LHS variab
> les, robust regression

. xi: rreg lwheatyield i.year*super1adj i.year*wheatsuit i.year*ln_ma_1789_ba_own_di
> st_default i.year*i.FE13,
i.year            _Iyear_1841-1929    (naturally coded; _Iyear_1841 omitted)
i.year*super1~j   _IyeaXsup_#         (coded as above)
i.year*wheats~t   _IyeaXwhe_#         (coded as above)
i.year*ln_ma_..   _IyeaXln__#         (coded as above)
i.FE13            _IFE13_1-12         (naturally coded; _IFE13_1 omitted)
i.year*i.FE13     _IyeaXFE1_#_#       (coded as above)
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity

   Huber iteration 1:  maximum difference in weights = .67332732
   Huber iteration 2:  maximum difference in weights = .17987294
   Huber iteration 3:  maximum difference in weights = .12519165
   Huber iteration 4:  maximum difference in weights = .0586359
   Huber iteration 5:  maximum difference in weights = .03878512
Biweight iteration 6:  maximum difference in weights = .29343187
Biweight iteration 7:  maximum difference in weights = .09199094
Biweight iteration 8:  maximum difference in weights = .06109324
Biweight iteration 9:  maximum difference in weights = .0449144
Biweight iteration 10:  maximum difference in weights = .02762588
Biweight iteration 11:  maximum difference in weights = .01350997
Biweight iteration 12:  maximum difference in weights = .00865705

Robust regression                               Number of obs     =      1,152
                                                F( 89,      1062) =      43.15
                                                Prob > F          =     0.0000

-----------------------------------------------------------------------------------
      lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |    2.87952    1.40903     2.04   0.041     .1147212    5.644319
      _Iyear_1912 |   2.131471    1.40903     1.51   0.131    -.6333273     4.89627
      _Iyear_1929 |   .7614078   1.394421     0.55   0.585    -1.974726    3.497542
        super1adj |   .0049275   .0026474     1.86   0.063    -.0002672    .0101221
   _IyeaXsup_1852 |  -.0001532   .0037439    -0.04   0.967    -.0074995    .0071931
   _IyeaXsup_1875 |  -.0063761   .0038005    -1.68   0.094    -.0138334    .0010812
   _IyeaXsup_1892 |  -.0039845   .0038005    -1.05   0.295    -.0114418    .0034728
   _IyeaXsup_1912 |  -.0015411   .0038005    -0.41   0.685    -.0089984    .0059162
   _IyeaXsup_1929 |  -.0019419   .0037439    -0.52   0.604    -.0092883    .0054044
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |   1.304023    1.40903     0.93   0.355    -1.460776    4.068822
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |          0  (omitted)
        wheatsuit |  -.0302117   .0113616    -2.66   0.008    -.0525054    -.007918
   _IyeaXwhe_1852 |   .0299041   .0160677     1.86   0.063     -.001624    .0614321
   _IyeaXwhe_1875 |   .0486004   .0161146     3.02   0.003     .0169803    .0802204
   _IyeaXwhe_1892 |   .0324644   .0161146     2.01   0.044     .0008444    .0640845
   _IyeaXwhe_1912 |   .0108069   .0161146     0.67   0.503    -.0208131     .042427
   _IyeaXwhe_1929 |   .0182958   .0160677     1.14   0.255    -.0132322    .0498239
      _Iyear_1852 |   1.058432   1.394421     0.76   0.448    -1.677702    3.794566
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |          0  (omitted)
ln_ma_1789_ba_o~t |   .2378377   .0750605     3.17   0.002      .090554    .3851213
   _IyeaXln__1852 |  -.0731247   .1061515    -0.69   0.491    -.2814152    .1351659
   _IyeaXln__1875 |  -.0929254    .107279    -0.87   0.387    -.3034283    .1175775
   _IyeaXln__1892 |  -.1984007    .107279    -1.85   0.065    -.4089036    .0121022
   _IyeaXln__1912 |   -.132327    .107279    -1.23   0.218    -.3428299    .0781759
   _IyeaXln__1929 |   -.043197   .1061515    -0.41   0.684    -.2514876    .1650935
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |          0  (omitted)
         _IFE13_2 |  -.2487282    .056198    -4.43   0.000        -.359   -.1384565
         _IFE13_3 |   .1847961   .0705422     2.62   0.009     .0463781    .3232141
         _IFE13_4 |  -.0947471   .0536665    -1.77   0.078    -.2000516    .0105574
         _IFE13_5 |  -.1143428   .0500277    -2.29   0.022    -.2125072   -.0161783
         _IFE13_6 |   .2945106   .0747482     3.94   0.000     .1478396    .4411815
         _IFE13_7 |   .0252912   .0503118     0.50   0.615    -.0734306    .1240129
         _IFE13_8 |    .094467   .0732049     1.29   0.197    -.0491756    .2381097
         _IFE13_9 |   .1054289   .0763748     1.38   0.168    -.0444337    .2552915
        _IFE13_10 |   .3557125    .075889     4.69   0.000     .2068031    .5046219
        _IFE13_11 |   .0490671   .0578268     0.85   0.396    -.0644007    .1625348
        _IFE13_12 |   .0631155    .068896     0.92   0.360    -.0720721    .1983032
 _IyeaXFE1_1852_2 |  -.0330033    .079476    -0.42   0.678    -.1889511    .1229445
 _IyeaXFE1_1852_3 |  -.0527184   .0997618    -0.53   0.597     -.248471    .1430342
 _IyeaXFE1_1852_4 |   .0770962   .0758959     1.02   0.310    -.0718268    .2260192
 _IyeaXFE1_1852_5 |  -.2989827   .0707499    -4.23   0.000    -.4378082   -.1601572
 _IyeaXFE1_1852_6 |  -.0753373   .1057099    -0.71   0.476    -.2827614    .1320867
 _IyeaXFE1_1852_7 |  -.2196767   .0711516    -3.09   0.002    -.3592904   -.0800631
 _IyeaXFE1_1852_8 |  -.4300925   .1035273    -4.15   0.000    -.6332339   -.2269511
 _IyeaXFE1_1852_9 |  -.1083954   .1080102    -1.00   0.316    -.3203332    .1035423
_IyeaXFE1_1852_10 |   -.040266   .1073232    -0.38   0.708    -.2508557    .1703237
_IyeaXFE1_1852_11 |  -.1008373   .0817794    -1.23   0.218    -.2613048    .0596303
_IyeaXFE1_1852_12 |  -.2204037   .0974336    -2.26   0.024    -.4115879   -.0292195
 _IyeaXFE1_1875_2 |   .1446798   .0796972     1.82   0.070     -.011702    .3010617
 _IyeaXFE1_1875_3 |   -.140848   .1001903    -1.41   0.160    -.3374415    .0557454
 _IyeaXFE1_1875_4 |  -.1706702   .0781027    -2.19   0.029    -.3239233   -.0174171
 _IyeaXFE1_1875_5 |  -.2719296   .0708313    -3.84   0.000    -.4109148   -.1329444
 _IyeaXFE1_1875_6 |   .0558519   .1060093     0.53   0.598    -.1521596    .2638634
 _IyeaXFE1_1875_7 |   .0397279   .0711769     0.56   0.577    -.0999354    .1793912
 _IyeaXFE1_1875_8 |  -.2491901   .1038246    -2.40   0.017    -.4529149   -.0454654
 _IyeaXFE1_1875_9 |  -.4406868   .1080937    -4.08   0.000    -.6527882   -.2285853
_IyeaXFE1_1875_10 |   -.074658   .1075843    -0.69   0.488      -.28576    .1364439
_IyeaXFE1_1875_11 |  -.0553848   .0818791    -0.68   0.499     -.216048    .1052785
_IyeaXFE1_1875_12 |  -.2640097   .0975056    -2.71   0.007    -.4553352   -.0726842
 _IyeaXFE1_1892_2 |   .0983802   .0796972     1.23   0.217    -.0580016    .2547621
 _IyeaXFE1_1892_3 |  -.2305611   .1001903    -2.30   0.022    -.4271545   -.0339676
 _IyeaXFE1_1892_4 |    .128595   .0781027     1.65   0.100    -.0246581    .2818481
 _IyeaXFE1_1892_5 |  -.0400608   .0708313    -0.57   0.572     -.179046    .0989244
 _IyeaXFE1_1892_6 |   .0488905   .1060093     0.46   0.645     -.159121     .256902
 _IyeaXFE1_1892_7 |  -.0201815   .0711769    -0.28   0.777    -.1598448    .1194818
 _IyeaXFE1_1892_8 |  -.1489367   .1038246    -1.43   0.152    -.3526614    .0547881
 _IyeaXFE1_1892_9 |   .0134678   .1080937     0.12   0.901    -.1986336    .2255693
_IyeaXFE1_1892_10 |  -.0042933   .1075843    -0.04   0.968    -.2153952    .2068087
_IyeaXFE1_1892_11 |  -.0985185   .0818791    -1.20   0.229    -.2591818    .0621447
_IyeaXFE1_1892_12 |  -.1708806   .0975056    -1.75   0.080    -.3622061    .0204449
 _IyeaXFE1_1912_2 |   .0051014   .0796972     0.06   0.949    -.1512805    .1614833
 _IyeaXFE1_1912_3 |  -.1025215   .1001903    -1.02   0.306    -.2991149     .094072
 _IyeaXFE1_1912_4 |   .0835076   .0781027     1.07   0.285    -.0697455    .2367607
 _IyeaXFE1_1912_5 |   .0498785   .0708313     0.70   0.481    -.0891067    .1888637
 _IyeaXFE1_1912_6 |   .1385952   .1060093     1.31   0.191    -.0694163    .3466067
 _IyeaXFE1_1912_7 |   -.040055   .0711769    -0.56   0.574    -.1797183    .0996083
 _IyeaXFE1_1912_8 |  -.2220704   .1038246    -2.14   0.033    -.4257952   -.0183457
 _IyeaXFE1_1912_9 |    .005044   .1080937     0.05   0.963    -.2070575    .2171454
_IyeaXFE1_1912_10 |   .1405312   .1075843     1.31   0.192    -.0705708    .3516332
_IyeaXFE1_1912_11 |  -.0723765   .0818791    -0.88   0.377    -.2330397    .0882868
_IyeaXFE1_1912_12 |  -.2386428   .0975056    -2.45   0.015    -.4299683   -.0473173
 _IyeaXFE1_1929_2 |   .3294748    .079476     4.15   0.000      .173527    .4854226
 _IyeaXFE1_1929_3 |   .0441795   .0997618     0.44   0.658    -.1515731     .239932
 _IyeaXFE1_1929_4 |   .1062755   .0758959     1.40   0.162    -.0426476    .2551985
 _IyeaXFE1_1929_5 |   .0052112   .0707499     0.07   0.941    -.1336143    .1440367
 _IyeaXFE1_1929_6 |   .0650082   .1057099     0.61   0.539    -.1424159    .2724322
 _IyeaXFE1_1929_7 |   .0195119   .0711516     0.27   0.784    -.1201018    .1591255
 _IyeaXFE1_1929_8 |  -.0765083   .1035273    -0.74   0.460    -.2796497    .1266331
 _IyeaXFE1_1929_9 |   .3072752   .1080102     2.84   0.005     .0953375     .519213
_IyeaXFE1_1929_10 |   .0012812   .1073232     0.01   0.990    -.2093085    .2118709
_IyeaXFE1_1929_11 |   .2735401   .0817794     3.34   0.001     .1130725    .4340076
_IyeaXFE1_1929_12 |  -.1229056   .0974336    -1.26   0.207    -.3140899    .0682786
            _cons |  -.6260068   .9860047    -0.63   0.526    -2.560746    1.308732
-----------------------------------------------------------------------------------

. lincom super1adj

 ( 1)  super1adj = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0049275   .0026474     1.86   0.063    -.0002672    .0101221
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1852

 ( 1)  super1adj + _IyeaXsup_1852 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0047742   .0026474     1.80   0.072    -.0004204    .0099689
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1875

 ( 1)  super1adj + _IyeaXsup_1875 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0014487   .0027267    -0.53   0.595    -.0067991    .0039017
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1892

 ( 1)  super1adj + _IyeaXsup_1892 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0009429   .0027267     0.35   0.730    -.0044075    .0062934
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1912

 ( 1)  super1adj + _IyeaXsup_1912 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0033864   .0027267     1.24   0.215     -.001964    .0087368
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1929

 ( 1)  super1adj + _IyeaXsup_1929 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0029855   .0026474     1.13   0.260    -.0022091    .0081801
------------------------------------------------------------------------------

. ereturn list

scalars:
               e(rank) =  90
               e(r2_a) =  .7652267197339742
                e(rss) =  22.66940133708901
                e(mss) =  81.98131131422879
               e(rmse) =  .1461025403434545
                 e(r2) =  .783380344359236
                  e(F) =  43.1528336919074
               e(df_r) =  1062
               e(df_m) =  89
                  e(N) =  1152

macros:
                e(cmd) : "rreg"
            e(cmdline) : "rreg lwheatyield _Iyear_* super1adj _IyeaXsup_* _Iyear.."
              e(title) : "Robust regression"
            e(predict) : "rreg_p"
             e(depvar) : "lwheatyield"
         e(properties) : "b V"
              e(model) : "ols"

matrices:
                  e(b) :  1 x 105
                  e(V) :  105 x 105

functions:
             e(sample)   

. *The difference between Column 1 and Column 2 is being driven by Cambrai and Arles
> ...

. *drop Cambrai and Arles (not reported in paper)

. xi: reg lwheatyield i.year*super1adj i.year*wheatsuit i.year*ln_ma_1789_ba_own_dis
> t_default i.year*i.FE13 if id~=1059003 & id~=1013003, cluster(deptid)
i.year            _Iyear_1841-1929    (naturally coded; _Iyear_1841 omitted)
i.year*super1~j   _IyeaXsup_#         (coded as above)
i.year*wheats~t   _IyeaXwhe_#         (coded as above)
i.year*ln_ma_..   _IyeaXln__#         (coded as above)
i.FE13            _IFE13_1-12         (naturally coded; _IFE13_1 omitted)
i.year*i.FE13     _IyeaXFE1_#_#       (coded as above)
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1892 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity
note: _Iyear_1852 omitted because of collinearity
note: _Iyear_1875 omitted because of collinearity
note: _Iyear_1912 omitted because of collinearity
note: _Iyear_1929 omitted because of collinearity

Linear regression                               Number of obs     =      1,140
                                                F(60, 60)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7324
                                                Root MSE          =     .16053

                                     (Std. Err. adjusted for 61 clusters in deptid)
-----------------------------------------------------------------------------------
                  |               Robust
      lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |   .8894234   2.194979     0.41   0.687    -3.501189    5.280036
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |  -.1964218   1.465316    -0.13   0.894     -3.12749    2.734646
        super1adj |    .011312   .0053659     2.11   0.039     .0005786    .0220455
   _IyeaXsup_1852 |  -.0007482   .0017643    -0.42   0.673    -.0042773    .0027808
   _IyeaXsup_1875 |  -.0138537   .0052822    -2.62   0.011    -.0244197   -.0032878
   _IyeaXsup_1892 |   -.010647   .0049181    -2.16   0.034    -.0204846   -.0008093
   _IyeaXsup_1912 |  -.0071273    .004752    -1.50   0.139    -.0166327    .0023782
   _IyeaXsup_1929 |  -.0080065   .0048322    -1.66   0.103    -.0176724    .0016594
      _Iyear_1852 |    .031807   .8812142     0.04   0.971    -1.730884    1.794498
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |          0  (omitted)
        wheatsuit |  -.0223061   .0164344    -1.36   0.180    -.0551798    .0105677
   _IyeaXwhe_1852 |   .0233152   .0122371     1.91   0.062    -.0011627    .0477931
   _IyeaXwhe_1875 |   .0316914   .0245315     1.29   0.201    -.0173789    .0807618
   _IyeaXwhe_1892 |    .026899   .0145869     1.84   0.070    -.0022791     .056077
   _IyeaXwhe_1912 |   .0060329   .0212555     0.28   0.778    -.0364844    .0485502
   _IyeaXwhe_1929 |   .0086133   .0198164     0.43   0.665    -.0310254     .048252
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |          0  (omitted)
      _Iyear_1912 |   .9318549   1.714942     0.54   0.589    -2.498539    4.362249
      _Iyear_1929 |          0  (omitted)
ln_ma_1789_ba_o~t |   .1226339   .1160021     1.06   0.295    -.1094047    .3546726
   _IyeaXln__1852 |   .0046888   .0664646     0.07   0.944    -.1282602    .1376378
   _IyeaXln__1875 |  -.0535081   .1679284    -0.32   0.751     -.389415    .2823988
   _IyeaXln__1892 |  -.0980183   .1160038    -0.84   0.401    -.3300604    .1340237
   _IyeaXln__1912 |  -.0367547   .1311293    -0.28   0.780    -.2990524     .225543
   _IyeaXln__1929 |   .0343285   .1135943     0.30   0.764    -.1928939    .2615508
      _Iyear_1852 |          0  (omitted)
      _Iyear_1875 |          0  (omitted)
      _Iyear_1892 |   1.610523   1.515463     1.06   0.292    -1.420854    4.641899
      _Iyear_1912 |          0  (omitted)
      _Iyear_1929 |          0  (omitted)
         _IFE13_2 |  -.1775842   .0694567    -2.56   0.013    -.3165183   -.0386501
         _IFE13_3 |   .2630429   .0949213     2.77   0.007      .073172    .4529139
         _IFE13_4 |   .0577408   .1252491     0.46   0.646    -.1927948    .3082764
         _IFE13_5 |  -.0883089    .057477    -1.54   0.130      -.20328    .0266622
         _IFE13_6 |   .3040637   .1151194     2.64   0.011     .0737906    .5343367
         _IFE13_7 |   .0179039   .0677005     0.26   0.792    -.1175172     .153325
         _IFE13_8 |   .1946675   .0732686     2.66   0.010     .0481085    .3412266
         _IFE13_9 |   .1039516   .1282414     0.81   0.421    -.1525693    .3604726
        _IFE13_10 |   .3971971   .1014355     3.92   0.000     .1942958    .6000984
        _IFE13_11 |   .1254679   .0558916     2.24   0.028     .0136682    .2372677
        _IFE13_12 |  -.0135894   .1381962    -0.10   0.922    -.2900229    .2628441
 _IyeaXFE1_1852_2 |  -.0388154   .0597919    -0.65   0.519    -.1584171    .0807863
 _IyeaXFE1_1852_3 |  -.0818287   .0731701    -1.12   0.268    -.2281907    .0645333
 _IyeaXFE1_1852_4 |   -.087008   .0590442    -1.47   0.146     -.205114     .031098
 _IyeaXFE1_1852_5 |  -.2318618   .0910334    -2.55   0.013    -.4139556    -.049768
 _IyeaXFE1_1852_6 |  -.0908154   .0665287    -1.37   0.177    -.2238926    .0422618
 _IyeaXFE1_1852_7 |  -.1360026   .0796228    -1.71   0.093     -.295272    .0232668
 _IyeaXFE1_1852_8 |  -.4643325    .075601    -6.14   0.000    -.6155569   -.3131081
 _IyeaXFE1_1852_9 |  -.0866168   .0779598    -1.11   0.271    -.2425596    .0693261
_IyeaXFE1_1852_10 |  -.0623151    .068619    -0.91   0.367    -.1995735    .0749433
_IyeaXFE1_1852_11 |  -.1246228   .0724915    -1.72   0.091    -.2696274    .0203818
_IyeaXFE1_1852_12 |  -.1370348    .055588    -2.47   0.017    -.2482274   -.0258421
 _IyeaXFE1_1875_2 |   .0448375   .1071317     0.42   0.677    -.1694578    .2591328
 _IyeaXFE1_1875_3 |  -.1837956    .129152    -1.42   0.160    -.4421381    .0745469
 _IyeaXFE1_1875_4 |  -.2992454   .1153657    -2.59   0.012    -.5300111   -.0684797
 _IyeaXFE1_1875_5 |  -.1112377   .1404992    -0.79   0.432    -.3922779    .1698025
 _IyeaXFE1_1875_6 |   .0779992   .1240557     0.63   0.532    -.1701492    .3261475
 _IyeaXFE1_1875_7 |  -.0110693   .1246005    -0.09   0.930    -.2603075    .2381689
 _IyeaXFE1_1875_8 |  -.3148325   .1304157    -2.41   0.019    -.5757027   -.0539624
 _IyeaXFE1_1875_9 |  -.3279206   .1651916    -1.99   0.052     -.658353    .0025118
_IyeaXFE1_1875_10 |  -.0567559   .1205414    -0.47   0.639    -.2978747    .1843628
_IyeaXFE1_1875_11 |  -.1050035   .1014741    -1.03   0.305    -.3079819    .0979748
_IyeaXFE1_1875_12 |    -.23359   .0922751    -2.53   0.014    -.4181677   -.0490123
 _IyeaXFE1_1892_2 |   .0316775   .0853764     0.37   0.712    -.1391007    .2024558
 _IyeaXFE1_1892_3 |  -.3122923   .1066413    -2.93   0.005    -.5256066    -.098978
 _IyeaXFE1_1892_4 |  -.0210245   .1053798    -0.20   0.843    -.2318155    .1897664
 _IyeaXFE1_1892_5 |  -.0682657   .0528839    -1.29   0.202    -.1740492    .0375178
 _IyeaXFE1_1892_6 |   .0452789    .089945     0.50   0.617    -.1346378    .2251956
 _IyeaXFE1_1892_7 |  -.0157484    .091567    -0.17   0.864    -.1989096    .1674128
 _IyeaXFE1_1892_8 |  -.2399585   .0724756    -3.31   0.002    -.3849313   -.0949857
 _IyeaXFE1_1892_9 |   .0256469    .101402     0.25   0.801    -.1771874    .2284812
_IyeaXFE1_1892_10 |   -.036139    .092625    -0.39   0.698    -.2214166    .1491386
_IyeaXFE1_1892_11 |  -.1685391   .0599766    -2.81   0.007    -.2885103    -.048568
_IyeaXFE1_1892_12 |  -.1825826   .0550739    -3.32   0.002    -.2927467   -.0724184
 _IyeaXFE1_1912_2 |   -.067909    .104659    -0.65   0.519    -.2772581    .1414402
 _IyeaXFE1_1912_3 |  -.1797034   .1038937    -1.73   0.089    -.3875217    .0281149
 _IyeaXFE1_1912_4 |  -.0699373   .1229612    -0.57   0.572    -.3158962    .1760216
 _IyeaXFE1_1912_5 |  -.0028574   .0718778    -0.04   0.968    -.1466344    .1409195
 _IyeaXFE1_1912_6 |   .1176777   .0993979     1.18   0.241    -.0811477    .3165031
 _IyeaXFE1_1912_7 |   -.059213   .1244256    -0.48   0.636    -.3081014    .1896753
 _IyeaXFE1_1912_8 |  -.3505352   .1056412    -3.32   0.002    -.5618492   -.1392213
 _IyeaXFE1_1912_9 |  -.0003853    .091541    -0.00   0.997    -.1834946    .1827239
_IyeaXFE1_1912_10 |   .0914534   .0942585     0.97   0.336    -.0970917    .2799985
_IyeaXFE1_1912_11 |  -.1605876   .0875402    -1.83   0.072     -.335694    .0145188
_IyeaXFE1_1912_12 |  -.2471868   .0692818    -3.57   0.001     -.385771   -.1086026
 _IyeaXFE1_1929_2 |   .2641035   .0810076     3.26   0.002     .1020641    .4261429
 _IyeaXFE1_1929_3 |  -.0108215   .0978239    -0.11   0.912    -.2064985    .1848555
 _IyeaXFE1_1929_4 |  -.0796155   .1398038    -0.57   0.571    -.3592648    .2000337
 _IyeaXFE1_1929_5 |   -.008144   .0755015    -0.11   0.914    -.1591694    .1428814
 _IyeaXFE1_1929_6 |   .0689788   .1095458     0.63   0.531    -.1501454     .288103
 _IyeaXFE1_1929_7 |   .0281592   .0869838     0.32   0.747    -.1458343    .2021527
 _IyeaXFE1_1929_8 |   -.156856   .0830365    -1.89   0.064    -.3229537    .0092417
 _IyeaXFE1_1929_9 |   .3206409   .1255113     2.55   0.013     .0695809    .5717009
_IyeaXFE1_1929_10 |  -.0125914   .0963389    -0.13   0.896    -.2052978     .180115
_IyeaXFE1_1929_11 |   .1706375   .1174902     1.45   0.152    -.0643778    .4056528
_IyeaXFE1_1929_12 |  -.0245421   .1273536    -0.19   0.848    -.2792871     .230203
            _cons |   .8323001    1.51847     0.55   0.586    -2.205091    3.869692
-----------------------------------------------------------------------------------

. lincom super1adj

 ( 1)  super1adj = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .011312   .0053659     2.11   0.039     .0005786    .0220455
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1852

 ( 1)  super1adj + _IyeaXsup_1852 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0105638    .005095     2.07   0.042     .0003724    .0207553
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1875

 ( 1)  super1adj + _IyeaXsup_1875 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0025417   .0032268    -0.79   0.434    -.0089963    .0039129
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1892

 ( 1)  super1adj + _IyeaXsup_1892 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0006651   .0025672     0.26   0.796    -.0044701    .0058003
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1912

 ( 1)  super1adj + _IyeaXsup_1912 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0041848   .0029991     1.40   0.168    -.0018143    .0101839
------------------------------------------------------------------------------

. lincom super1adj + _IyeaXsup_1929

 ( 1)  super1adj + _IyeaXsup_1929 = 0

------------------------------------------------------------------------------
 lwheatyield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0033056   .0031787     1.04   0.303    -.0030528    .0096639
------------------------------------------------------------------------------

. ereturn list

scalars:
               e(rank) =  61
               e(ll_0) =  -236.6917796863949
                 e(ll) =  514.6531855865517
               e(r2_a) =  .7096849428038199
                e(rss) =  27.0586342255117
                e(mss) =  74.04592399548002
               e(rmse) =  .1605307691186355
                 e(r2) =  .7323697892396934
                  e(F) =  .
               e(df_r) =  60
               e(df_m) =  60
                  e(N) =  1140
            e(N_clust) =  61

macros:
            e(cmdline) : "regress lwheatyield _Iyear_* super1adj _IyeaXsup_* _Iy.."
              e(title) : "Linear regression"
          e(marginsok) : "XB default"
                e(vce) : "cluster"
             e(depvar) : "lwheatyield"
                e(cmd) : "regress"
         e(properties) : "b V"
            e(predict) : "regres_p"
              e(model) : "ols"
          e(estat_cmd) : "regress_estat"
            e(vcetype) : "Robust"
           e(clustvar) : "deptid"

matrices:
                  e(b) :  1 x 105
                  e(V) :  105 x 105
       e(V_modelbased) :  105 x 105

functions:
             e(sample)   

. 
. log close
      name:  <unnamed>
       log:  /Users/noeljohnson/Dropbox/Research/Revolutionary Expropriation/Replica
> tion Files/Table 8.log
  log type:  text
 closed on:   5 Oct 2020, 12:31:09
------------------------------------------------------------------------------------
